{
    "presentation": { 
        "job": "Fullstack developer",
        "name": "Léa Hammon",
        "summary1": "My main value is transparency and I truly believe that good communication is essential to build a project.",
        "summary2": "My main goal is to produce high quality code and to work with the client in order to deliver a competitive product."
    },
    "contact": {
        "address": "95 boulevard Saint Michel",
        "cityAndCountry": "75005 Paris, France",
        "mail": "hammon.lea@gmail.com",
        "phone": "+33 6 70 45 62 36"
    },
    "technicalSkills": {
        "title": "Technical skills",
        "table": [
            {
                "category": "Front-end",
                "list": "Angular, Javascript, Typescript, Backbone, Karma, HTML5, CSS3/SASS, PostgreSQL"
            },
            {
                "category": "Back-end",
                "list": "Node.JS, Express, Java"
            },
            {
                "category": "Management",
                "list": "JIRA, Trello, Agile methodologies, Scrum, Kanban, Visual management, Mangement 3.0"
            },
            {
                "category": "OtherTools",
                "list": "Git, CentOS, Gitlab CI, Jenkins, AWS S3"
            }
        ]
    },
    "languages": {
        "title": "Languages",
        "table": [
            {
                "language": "French",
                "level": "Native"
            },
            {
                "language": "English",
                "level": "Fluent"
            }
        ]
    },
    "professionalExperiences": {
        "title": "Professional experiences",
        "table": [
            {
                "startDate": "February 2020",
                "endDate": "now",
                "jobTitle": "Freelance fullstack developer",
                "missions": [
                    {
                        "taskList": [
                            "Worked on securing s3 bucket. After a S3 bucket has been changed from public to private, I worked on developing API to get, save and modify files on the private S3 bucket."
                        ],
                        "technicalEnvironment": "Node.JS, Express, Android, AWS S3"
                    },
                    {
                        "taskList": [
                            "Worked on a back-end PDF generator."
                        ],
                        "technicalEnvironment": "Node.JS, Express, Puppeteer"
                    }
                ]
            },
            {
                "startDate": "September 2019",
                "endDate": "December 2019",
                "jobTitle": "Fullstack developer at Pixium Digital",
                "missions": [
                    {
                        "taskList": [
                            "Worked on a video chat using WebRTC library: (Put the speaker on full screen, Screen sharing)",
                            "Developed a typescript module to display data in table and graph, using amchart library. The module also contains pdf and excel exports and graph management.",
                            "Worked on bug fixing and new functionnalities for a banking advisor project. It includes a web application for the advisor, an ionic mobile application for the user (available on ios and android) and a Java API that uses Saltedge to communicate with banks’ API and Amazon SNS with Firebase to handle push notifications.",
                            "Integrated a 3D viewer that allows the user to visualize, manage and export a 3D model: (Modification of light, Functionnality to make cross-sections, Export of screen capture, Functionnality to compare multiple models)"
                        ],
                        "technicalEnvironment": "Angular, Java, Typescript, Ionic, WebRTC, AWS, PHP, Yii, Karthik"
                    }
                ]
            },
            {
                "startDate": "January 2019",
                "endDate": "September 2019",
                "jobTitle": "Fullstack developer at Amaris",
                "missions": [
                    {
                        "taskList": [
                            "Worked on bug fixing and production incidents.",
                            "Managed the communication between teams in Switzerland and the development team in Singapore.",
                            "Trained and mentored new team member to acquire the necessary skills to become autonomous on the project."
                        ],
                        "technicalEnvironment": "Angular, AngularJS, Java, Spring, Javascript, Typescript, Jenkins, Subversion, Git, HTML5, Jira"
                    },
                    {
                        "taskList": [
                            "Realized a web application to manage user account: connection via mail and social media and update profile."
                        ],
                        "technicalEnvironment": "Javascript, Gigya, Jenkins, Git, HTML5, SASS, Scrum, Jira"
                    }
                ]
            },
            {
                "startDate": "February 2017",
                "endDate": "November 2018",
                "jobTitle": "Scrum master and fullstack developer at Soat",
                "missions": [
                    {
                        "taskList": [
                            "Realized a web application to administrate data of the French plan to install very high speed internet everywhere in the country. It administrates technical and financial data. (using Angular 4-6, Typescript)",
                            "Realized an API with REST (using NodeJs)",
                            "Designed and integrated the user interface (using Photoshop, HTML5, SASS)",
                            "Modelling and designing the database (PostgreSQL)",
                            "System administration, managing CentOS 7 servers (develop, staging, production), managing VM with Proxmox and continous integration with GitLab-CI",
                            "Organized, animated and facilitated agile ceremonies and the kick-off of the project (story mapping, visual management, and team statistics)",
                            "Helped the relations between the client and the team",
                            "Writing articles on agile subject"
                        ],
                        "technicalEnvironment": "Angular 4-6, Node.JS, Express, Typescript, Javascript, PostgreSQL, HTML5, SASS, Karma, Git, CentOS, Gitlab CI, Scrum, Trello, Photoshop"
                    }
                ]
            },
            {
                "startDate": "February 2015",
                "endDate": "December 2016",
                "jobTitle": "Mobile consultant at Sogeti",
                "missions": [
                    {
                        "taskList": [
                            "Realized a web application to allow professionals to make bank transfers."
                        ],
                        "technicalEnvironment": "Java 7, BackboneJS, HTML5, SASS, Karma, Git, Scrum"
                    },
                    {
                        "taskList": [
                            "Realized an Android application to help technicians performs interventions in data centers. This application is a combination between tablet and glasses. The technician can manage his intervention from the tablet and then perform the intervention with the help of the glasses."
                        ],
"                        technicalEnvironment": "Android, connected glasses"
                    },
                    {
                        "taskList": [
                            "Integrated advertisement banners inside an existing application."
                        ],
                        "technicalEnvironment": "Javascript, Jquery, HTML5, CSS3"
                    },
                    {
                        "taskList": [
                            "Realized a hybrid application, using the framework Cordova. This mobile application allows a user to locate his position inside a building. This project uses Bluetooth technology (beacons)."
                        ],
                        "technicalEnvironment": "Cordova, Javascript, HTML5, CSS3, MVC, Bluetooth beacons"
                    },
                    {
                        "taskList": [
                            "Realized a Cordova plugin using outdoor localization and augmented reality. It allows a user to find specific point of interest around him using augmented reality."
                        ],
                        "technicalEnvironment": "Cordova, Javascript, HTML5, CSS3, augmented reality"
                    },
                    {
                        "taskList": [
                            "Connected vehicles: recovered and processed frames on a server."
                        ],
                        "technicalEnvironment": "C, MySQL, Serveur Linux, Machine to machine"
                    }
                ]
            },
            {
                "startDate": "April 2014",
                "endDate": "August 2014",
                "jobTitle": "Intern at CKAB a start-up specialized in 3D-printing and connected object",
                "missions": [
                    {
                        "taskList": [
                            "Study of the Hall Effect in order to designed a prototype of distance sensor based on the Hall Effect.",
                            "Mechanical and electronic improvement of the Makerbot 3D-printer.",
                            "Redaction of tutorials to help the community to better use their 3D-printers."
                        ],
                        "technicalEnvironment": "Arduino"
                    }
                ]
            }
        ]
    },
    "education": {
        "title": "Education",
        "table": [
            {
                "startDate": "2010",
                "endDate": "2015",
                "title": "Engineering degree at ESIEA",
                "description": "With highest honour and congratulations from the Jury. ESIEA is a French engineering school which provides a five-year engineering degree as a Master of Computer Science"
            }
        ]
    },
    "referees": {
        "title": "Referees",
        "table": [
            {
                "name": "Remi Tache",
                "jobTitle": "Director of Pixum Digital",
                "contactType": "Email",
                "contactLink": "remi.tache@pixiumdigital.com"
            },
            {
                "name": "Julien Mulaton",
                "jobTitle": "Manager of Front Team in Azqore",
                "contactType": "LinkedIn",
                "contactLink": "https://www.linkedin.com/in/julienmulaton/"
            },
            {
                "name": "Ariane Rose",
                "jobTitle": "Manager of the technical team in Agence du numérique at the French Ministry of Finance and Economy",
                "contactType": "Email",
                "contactLink": "ariane.rose@finances.gouv.fr"
            }
        ]
    }
}